04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/coolingCylinder2D/0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentOmega];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            turbulentOmega;
        mixingLength    0.0035;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
